# print("Hello world!")
# # Простой вывод

# age = 26
# name = 'Iskander' " " 'Zakirov'  # можно просто написать рядом строки и они объединятся. ' и " равнозначны.
# print('Возраст {1} -- {0} лет.'.format(age, name))  # format - преобразует строку, добавляя в неё данные
# print('Возраст ' + name + ' -- ' + str(age) + ' лет.')  # можно объединять плюсами, метод str() - преобразование типов
# print('Почему {} "забавляется" с этим Python?'.format(name))  # можно и без обознчения позиции
# print('Я пою песню: {0}-{0}-{0}-{0}'.format("Ла"))
# " можно использовать в ' и наоборот
# # разные варианты использования .format
# print('{0:_^11}'.format('hello'))  # дополнение _ до 11 символов
# print('{0:.3}'.format(1/3))  # десятичное число с точностью до 3-х символов после запятой
# print('{name} написал {book}'.format(name='Swaroop', book='A Byte of Python'))  # использование ключевых слов

# s = '''Это "многострочная" строка.
# Это вторая её строчка.'''
# print(s) # в пределах этих кавычек можно использовать " и ' свободно

# s = 'Это строка. ' \
#     'Это строка продолжается.'
# print\
#     (s)  # если строчка кода слишком длинная, её можно перенести на следующую

# в питоне есть целые, дробные и комплексные числа
